Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: སྟོན་པ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲིར་གནས་འགྱུར་སྐུ་གདུང་གཅིག །དཔག་ཚད་ལྔ་པའི་མཆོད་རྟེན་གཅིག་ཅིག་འབྱུང་། །
en: And after the teacher has attained nirvāṇa “The sacred Dharma will remain for seventy thousand years. There will be a single relic and single stūpa, measuring five leagues.

source: དེ་བཞིན་གཤེགས་པ་སྟོབས་ཀྱི་ལྷ་དེ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འོད་པོ་ཆེ་ཞེས་བྱ། །
en: The thus-gone Baladeva will be born In a place called Great Light.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཉི་ཤུ་གཉིས་ཡོད་ལེགས་བཟང་ཡབ། །ཟླ་འོད་ཅེས་ནི་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be kṣatriya, And his light will extend twenty-two leagues. Exquisite Excellence will be his father and Moonlight his mother.

source: སྲས་པོ་དབང་འོད་དགའ་བོ་རིམ་གྲོ་པ། །
en: Capable Light will be his son and Joyous will be his attendant.

source: སེང་གེའི་བློ་གྲོས་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Lion Intelligence will be the scholar

source: སྲིད་པའི་བཤེས་གཉེན་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Friend of Existence will be the one of miracles.

source: འདུས་པ་དང་པོར་རྡུལ་རྣམས་བཅོམ་པ་པོ། །བྱེ་བ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་གསུམ་ཡོད། །འདུས་པ་གཉིས་པར་དགུ་བཅུ་རྩ་གཉིས་ཡོད། །འདུས་པ་གསུམ་པར་དགུ་བཅུ་རྩ་གཅིག་ཡོད། །
en: In the first congregation there will be Nine hundred thirty billion who have conquered matter; “In the second there will be nine hundred twenty billion; And in the third there will be nine hundred ten billion.

source: སྐུ་ཚེ་ལོ་གྲངས་དག་ནི་དགུ་སྟོང་ཡིན། །
en: His lifespan will be nine thousand years

source: དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུར་གནས། །
en: And the sacred Dharma will remain for seventy thousand years.

source: དེ་ཡི་སྐུ་གདུང་དག་ཀྱང་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་བརྒྱད་ཅུ་ཐམ། །
en: “His relics will be abundant, And there will be eight hundred billion stūpas.

source: མཚུངས་པ་མེད་པ་ཡོན་ཏན་ཕྲེང་ལྡན་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་སྡུག་ཅེས་བྱ། །
en: The incomparable Guṇamālin will be born In a place called Delightful Joy.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་དྲུག་ཡབ་ནི་ན་ཚོད་བཟང་། །སྐལ་ལྡན་ང་རོ་ཞེས་བྱ་ཡུམ་ཡིན་ནོ། །
en: “His family will be brahmin, And his light will extend seventy-six leagues. Excellent Youth will be his father and Fortunate Roar his mother.

source: དེ་ཚེ་རྒྱལ་བའི་སྲས་པོ་ཚངས་བདག་ཡིན། །
en: The son of this victor will be called Brahmā Master

source: བློ་རྫོགས་ཞེས་ནི་བྱ་བ་རིམ་གྲོ་པ། །
en: “And Perfect Wisdom will be his attendant.

source: ལག་བཟངས་མཁས་པ་བཞིན་བཟངས་རྫུ་འཕྲུལ་ཅན། །
en: Excellent Hand will be the scholar and Excellent Countenance the one of miracles.

source: དང་པོར་ཚོགས་པ་དགྲ་བཅོམ་བྱེ་བ་སྟོང་། །གཉིས་པ་དག་ཏུའང་དེ་སྙེད་ཡོད་གྱུར་ལ། །འདུས་པ་གསུམ་པ་དག་ཏུ་ལྔ་འགྱུར་ཡོད། །
en: In the first congregation there will be ten billion worthy ones; In the second there will be the same amount; And in the third there will be five times more.

source: མཚུངས་མེད་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བྱེ་བ་ཕྲག་ནི་གསུམ་དུ་གནས། །
en: And after this incomparable one has attained nirvāṇa The sacred Dharma will remain for thirty million years.

source: མཆོད་རྟེན་བྱེ་བ་དགུ་བཅུ་རྩ་དགུ་སྟེ། །ཐམས་ཅད་གསེར་དག་གིས་ནི་ཁྱབ་པར་འགྱུར། །
en: “There will be nine hundred ninety million stūpas, All of them covered in pure gold.

source: བདེ་བར་གཤེགས་པ་ཀླུ་ཡི་ལག་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་ཞེས་ཀྱང་བྱ། །
en: The well-gone one Nāgabhuja will be born At a place called Joy.

source: མགོན་པོའི་རིགས་ནི་བྲམ་ཟེ་དག་ཏུ་འགྱུར། །
en: “The family of this protector will be brahmin

source: གླིང་ཕྲན་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་རྣམས། །དེ་ཡི་འོད་ཀྱིས་རྟག་པ་དག་ཏུ་ཁྱབ། །
en: And his light will constantly illumine Seventy-two thousand islands.

source: དེ་ཡི་ཡབ་ནི་ཚོགས་ཅན་འོད་ཡིན་ལ། །དེ་ཡི་ཡུམ་ནི་སྤོས་ལྡན་མ་ཞེས་བྱ། །
en: Accumulating Light will be his father “And Fragrant his mother.

source: སྲས་པོ་དེས་པ་འོད་འཕྲོ་རིམ་གྲོ་པ། །
en: Gentle will be his son and Radiant his attendant.

source: ཡེ་ཤེས་རྣམ་ལྟ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Wisdom View will be the scholar

source: བདེན་པར་སྨྲ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Truth Speaker the one of miracles.

source: འདུས་པ་དང་པོར་བྱེ་བ་བཅུ་དྲུག་ཡོད། །གཉིས་པར་བཅྭ་བརྒྱད་གསུམ་པར་ཉི་ཤུ་ཡོད། །
en: “In the first congregation there will be one hundred sixty million, In the second there will be one hundred eighty million, and in the third there will be two hundred million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་གྲངས་སྟོང་ཕྲག་བཅུ། །
en: His lifespan will be ten thousand years.

source: བདེ་བར་གཤེགས་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་ཕྲག་བརྒྱད་གནས། །དེ་ཡི་མཆོད་རྟེན་བྱེ་བ་དགུ་བཅུ་དགུ། །
en: After this well-gone one has transcended suffering, “His sacred Dharma will remain for eighty million years And there will be nine hundred ninety million stūpas.

source: བདེ་བར་གཤེགས་པ་མིག་ནི་བརྒྱན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོད་རྟེན་མཆོག་ཅེས་བྱ། །
en: The well-gone one Pratimaṇḍita­locana will be born In a place called Supreme Stūpa.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཡོད་ཡབ་ནི་གྲོགས་བཟང་ཡིན། །ཡུམ་ནི་དྲ་བ་ཅན་གྱི་འོད་ཅེས་བྱ། །
en: “The family of this victor will be brahmin, And his light will extend seven leagues. Excellent Companion will be his father and Nets of Light his mother.

source: སྲས་པོ་ཤུགས་དགའ་གྲོལ་བ་རིམ་གྲོ་པ། །
en: Joyous Force will be his son and Liberated his attendant.

source: ཆོས་མཐོང་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: “Dharma Perception will be the scholar

source: མཉམ་པར་བཞག་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Equipoise the one of miracles.

source: འདུས་པ་དང་པོར་དགྲ་བཅོམ་བྱེ་སྟོང་བརྒྱ། །འདུས་པ་གཉིས་པར་དགྲ་བཅོམ་ཚོགས་པ་དག །བྱེ་སྟོང་དགུ་བཅུ་གསུམ་པར་བརྒྱད་ཅུ་ཡོད། །
en: In the first congregation there will be one trillion worthy ones. In the second will gather “Nine hundred billion worthy ones, and in the third there will be eight hundred billion.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུ་དྲུག །
en: His lifespan will be twenty-six thousand years,

source: སངས་རྒྱས་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བའི་བར་དུ་གནས། །
en: And after this buddha has attained parinirvāṇa His sacred Dharma will remain for ten million years.

source: མཆོད་རྟེན་བཟང་པོ་གྲངས་ནི་བྱེ་བ་སྟེ། །རིན་ཆེན་བརྒྱ་ཡི་དྲ་བས་རྣམ་པར་སྤྲས། །
en: “There will be ten million fine stūpas, Adorned with nets of hundreds of jewels.

source: སངས་རྒྱས་ལེགས་པར་སྦྱངས་པའི་བློ་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་བཅུ་ལྡན་ཞེས་ཀྱང་བྱ། །
en: The buddha Sucīrṇabuddhi will be born In a place called Endowed with Ten.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཉིས་ཡོད་ཡབ་ནི་དབང་ཆེན་ཡིན། །ཏོག་འོད་ཅེས་བྱ་ཡུམ་ཡིན་སྲས་པོ་ནི། །སྐྱེ་བའི་ཁྱུ་མཆོག་རྒྱན་ནི་རིམ་གྲོ་པ། །
en: “The family of this victor will be kṣatriya, And his light will extend two leagues. Great Mastery will be his father and Crest Light his mother. Leader of Humanity will be his son and Ornament his attendant.

source: ཚིག་གི་ཁ་ལོ་སྒྱུར་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Word Leader the one of miracles.

source: དགྲ་བཅོམ་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་གཉིས་ཡོད། །གཉིས་པར་དེ་ན་སུམ་ཅུ་ཡོད་པར་འགྱུར། །འདུས་པ་གསུམ་པར་ཉི་ཤུ་རྩ་ཡང་བརྒྱད། །
en: Twenty-two thousand worthy ones will gather. In the second congregation there will be thirty thousand, “And in the third there will be twenty-eight thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་གྲངས་སྟོང་ཡིན་ནོ། །
en: His lifespan will be one thousand years,

source: སངས་རྒྱས་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་བཞིར་སྤྱོད། །
en: And after this buddha has attained nirvāṇa His sacred Dharma will remain practiced for fourteen thousand years.

source: མཚུངས་པ་མེད་པའི་སྐུ་གདུང་མཆོད་རྟེན་ནི། །གཅིག་ཡིན་དཔག་ཚད་རངས་པ་གཅིག་ཙམ་མོ། །
en: “There will be a single relic of this incomparable being, Contained in a stūpa measuring an entire league.

source: སངས་རྒྱས་ཟིལ་གྱིས་གནོན་པ་ཡེ་ཤེས་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་འདོད་ཅེས་བྱ། །
en: The buddha Jñānābhibhū will be born In a place called Wish for Joy.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཉིས་ཡོད་ཡབ་ནི་མཐུ་ལྡན་ཡིན། །བརྟུལ་ཞུགས་བདེན་པ་ཡུམ་ཡིན་སྲས་པོ་ནི། །དྲང་སྲོང་སྡུག་པ་དགའ་བོ་རིམ་གྲོ་པ། །
en: “The family of this victor will be kṣatriya, And his light will extend two leagues. Powerful will be his father and True Yogic Discipline his mother. Delightful Sage will be his son and Joyous his attendant.

source: ཆོས་ཀྱིས་རྣམ་པར་རོལ་པ་མཁས་པ་སྟེ། །
en: “Dharma Display will be the scholar

source: ཟླ་བའི་འོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Moonlight the one of miracles.

source: འདུས་པ་དང་པོར་བྱེ་ཕྲག་བཅུ་གསུམ་ཡོད། །གཉིས་པར་བཅུ་གཉིས་གསུམ་པ་དག་ཏུ་བརྒྱད། །
en: In the first congregation there will be one hundred thirty million, In the second there will be one hundred twenty million, and in third, eighty million.

source: སྐུ་ཚེ་ལོ་གྲངས་བརྒྱ་ཕྲག་གཉིས་ཀྱང་ཡིན། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་སྟོང་དུ་གནས། །
en: “His lifespan will be two hundred years And his sacred Dharma will remain for ten billion years.

source: དེ་ཡི་སྐུ་གདུང་དག་ཀྱང་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་སུམ་ཅུ་གཉིས། །མཆོད་རྟེན་ཀུན་ཀྱང་དཔག་ཚད་གཉིས་པ་སྟེ། །ཐམས་ཅད་གདུགས་གྲངས་སྟོང་ཕྲག་བརྒྱད་ཅུས་ཁྱབ། །
en: His relics will be abundant, And there will be thirty-two billion stūpas, “Each of them measuring two leagues And adorned with eighty thousand parasols.

source: སངས་རྒྱས་མཐའ་ཡས་པ་ཡི་སྤྱན་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་འོད་གསལ་ཡིན། །
en: The buddha Amitalocana will be born In a place called Luminous Merit.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཞི་ཡོད་ཡབ་ནི་བརྟུལ་ཞུགས་ཤེས། །ཆོས་གནས་ཞེས་བྱ་ཡུམ་ཡིན་སྲས་པོ་ནི། །རྒྱལ་བར་དགའ་བ་སྙིང་པོ་རིམ་གྲོ་པ། །
en: “The family of this victor will be brahmin, And his light will extend four leagues. Knowledge of Yogic Discipline will be his father and Dharma Adherence his mother. Delighting in Victory will be his son and Essence his attendant.

source: མེ་ཏོག་ཚོགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Flower Gathering will be the scholar

source: གླང་པོའི་འགྲོས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Elephant Gait the one of miracles.

source: དགྲ་བཅོམ་བྱེ་བ་བརྒྱ་ཕྲག་དྲུག་ཅུ་དྲུག །གཉིས་པར་ལྔ་ཡོད་གསུམ་པ་དག་ཏུ་བདུན། །
en: Sixty-six billion worthy ones will gather. In the second gathering will be sixty-five billion, and in the third there will be sixty-seven billion.

source: ཐུགས་རྗེ་ཅན་གྱི་སྐུ་ཚེའི་ཚད་དག་ནི། །ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་ཡང་གསུམ། །བདུད་རྣམས་བརླག་མཛད་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་ཡི་བར་དུ་གནས། །
en: “The lifespan of this compassionate one Will be twenty-three thousand years, And the sacred Dharma of this destroyer of the māras Will remain for ten thousand years.

source: མཆོད་རྟེན་བྱེ་བ་ཕྲག་བཅུ་ཚང་བ་སྟེ། །མེ་ཏོག་རྒྱན་དང་རྟ་བབས་དག་གིས་བརྒྱན། །
en: “There will be one hundred million stūpas, Adorned with flowers and archways.

source: དེ་བཞིན་གཤེགས་པ་བདེན་པར་གསུང་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མདངས་དང་ལྡན་ཞེས་བྱ། །
en: The thus-gone Satyabhāṇin will be born In a place called Endowed with Brightness.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་བསོད་ནམས་བཟང་། །ལྷ་འོད་ཅེས་ནི་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “The family of this victor will be kṣatriya, And his light will extend nine leagues. Excellent Merit will be his father and Divine Light his mother.

source: སྲས་པོ་དོན་ཆེན་འོད་ལྡན་རིམ་གྲོ་པ། །
en: Great Objective will be his son and Luminous his attendant.

source: ཡེ་ཤེས་ཡང་དག་འཕགས་པ་མཁས་པ་སྟེ། །
en: “Superior True Wisdom will be the scholar

source: སྲིད་པར་འགྲོ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Moving in Existence the one of miracles.

source: དགྲ་བཅོམ་བྱེ་བ་བརྒྱ་ཕྲག་ཉི་ཤུ་སྟེ། །གཉིས་པར་བྱེ་བ་བརྒྱ་ནི་ཚང་བར་ཡོད། །འདུས་པ་གསུམ་པར་བྱེ་བ་དགུ་བཅུ་ཡོད། །
en: Twenty billion worthy ones will gather. In the second gathering will be one billion, “And in the third there will be nine hundred million.

source: ཞི་བར་གྱུར་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུ་གཉིས་སུ་གནས། །
en: And the sacred Dharma of this being of peace Will remain for twenty-two thousand years.

source: མཆོད་རྟེན་དམ་པ་བྱེ་བ་དྲུག་ཅུ་སྟེ། །གསེར་ལས་བྱས་པའི་རྒྱལ་མཚན་དག་གིས་གང་། །
en: “There will be six hundred million holy stūpas, Studded with golden banners.

source: དེ་བཞིན་གཤེགས་པ་ཉི་མའི་འོད་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་སྨན་ཞེས་བྱ་བ་ཡིན། །
en: The thus-gone Sūryaprabha will be born In a place called Medicine.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་མིག་བཟང་ཡིན། །ཚུལ་ཁྲིམས་ལྡན་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “The family of this victor will be kṣatriya, And his light will extend three leagues. Excellent Eye will be his father and Endowed with Discipline his mother.

source: སྲས་པོ་ཐར་དགའ་ཞི་བ་རིམ་གྲོ་པ། །
en: Liberation Joy will be his son and Peace his attendant.

source: ནོར་གྲགས་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: “Precious Fame will be the scholar

source: རྙོག་པ་མེད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Unsullied the one of miracles.

source: འདུས་པ་དང་པོར་བྱེ་ཕྲག་སུམ་ཅུ་གཉིས། །འདུས་པ་གཉིས་པར་བྱེ་ཕྲག་ཉི་ཤུ་གཅིག །འདུས་པ་གསུམ་པར་བྱེ་ཕྲག་སུམ་ཅུ་ཐམ། །
en: In the first congregation there will be three hundred million, In the second there will be two hundred ten million, “And in the third there will be three hundred million.

source: སྐུ་ཚེ་ལོ་གྲངས་འབུམ་ཕྲག་དྲུག་ཅུ་ཡིན། །
en: His lifespan will be six million years,

source: དམ་ཆོས་ལོ་གྲངས་ས་ཡ་ཕྲག་གཅིག་དང་། །འབུམ་ཕྲག་གསུམ་གྱི་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma will remain For one million three hundred thousand years.

source: མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་དགུ་ཡོད་དེ། །གསེར་ལས་བྱས་པའི་རྒྱལ་མཚན་དག་གིས་གང་། །
en: “There will be nine billion stūpas, Studded with golden banners.

source: དེ་བཞིན་གཤེགས་པ་དེས་པའི་བློ་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་སྡུག་ཅེས་བྱ། །
en: The thus-gone Niyatabuddhi will be born In a place called Delightful Joy.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ཁྱད་པར་འཕགས། །བདེ་ལྡན་མ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “The family of this victor will be brahmin, And his light will extend ten leagues. Distinguished will be his father and Blissful his mother.

source: གང་པོ་སྲས་ཡིན་སྐར་མ་རིམ་གྲོ་པ། །
en: Whole will be his son and Star his attendant.

source: ལྷག་ཤེས་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: “Special Knowledge will be the scholar

source: བདུད་སྤོང་ཞེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Abandoning the Māras the one of miracles.

source: འདུས་པ་དང་པོར་ཕལ་ཆེན་བྱེ་བ་བརྒྱ། །གཉིས་པར་བརྒྱད་ཅུ་གསུམ་པར་དྲུག་ཅུ་ཡོད། །
en: In the first great congregation will be one billion. In the second there will be eight hundred million, and in the third there will be six hundred million.

source: མི་རྣམས་ཚེ་ཚད་ལོ་གྲངས་སྟོང་ཕྲག་བཅུ། །དེ་ཡིས་ལྔ་འགྱུར་དུ་ནི་དམ་ཆོས་གནས། །
en: “The lifespan of humans will be ten thousand years And the sacred Dharma will remain five times as long.

source: འཛམ་བུའི་གླིང་ན་སྐུ་གདུང་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་བརྒྱད་ཅུ་བརྒྱད། །
en: His relics will be abundant in Jambudvīpa And there will be eighty-eight billion stūpas.

source: མཆོད་རྟེན་རེ་རེ་དག་གི་ཐད་ན་ཡང་། །མར་མེ་བྱེ་བ་བརྒྱ་ཕྲག་ཉིན་མཚན་འབར། །
en: “One billion butter lamps will burn At each stūpa, throughout day and night.

source: དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་གཟུགས་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོད་པ་ཞེས་ཀྱང་བྱ། །
en: The thus-gone Anantarūpa will be born In a place called Worship.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །
en: “His family will be kṣatriya,

source: དཔག་ཚད་ཉི་ཤུ་རྩ་བཞི་གྲོགས་བཟང་ཡབ། །བཟང་ལྡན་མ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: And his light will extend twenty-four leagues. Excellent Companion will be his father and Endowed with Excellence his mother.

source: སྲས་པོ་འཇིགས་མེད་འོད་ལྡན་རིམ་གྲོ་པ། །
en: Fearless will be his son and Luminous his attendant.

source: གསང་སྔགས་གདོན་མི་ཟ་བ་མཁས་པ་སྟེ། །
en: “Indubitable Secret Mantra will be the scholar

source: བདེ་བའི་འོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Light of Bliss the one of miracles.

source: ཤིན་ཏུ་དགའ་བའི་བློ་ཅན་དགྲ་བཅོམ་པ། །བྱེ་བ་ལྔ་བཅུ་རྩ་དྲུག་གཉིས་པར་ལྔ། །འདུས་པ་གསུམ་པར་ལྔ་བཅུ་རྩ་ཡང་བཞི། །
en: Five hundred sixty million extremely joyous worthy ones will gather. In the second congregation will be five hundred fifty million, “And in the third there will be five hundred forty million.

source: བདེ་བར་གཤེགས་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བའི་བར་དུ་གནས། །
en: And after the well-gone has attained nirvāṇa The sacred Dharma will remain ten million years.

source: མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་སུམ་ཅུ་གཉིས། །རིན་ཆེན་པད་མ་དག་གིས་རྣམ་པར་སྤྲས། །
en: “There will be thirty-two billion stūpas, Adorned with jewel lotuses.

source: བདེ་བར་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་རྫོགས་ཞེས་བྱ། །
en: The well-gone Vairocana will be born In a place called Perfect Flowers.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་ལྔ་ཡོད་ཡབ་ནི་ན་ཚོད་བཟང་། །གང་གཱའི་མཆོག་ཅེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “The family of this victor will be kṣatriya, And his light will extend five leagues. Excellent Youth will be his father and Supreme Gaṅgā his mother.

source: སྲས་པོ་འོད་མཐའ་གང་པོ་རིམ་གྲོ་པ། །
en: Light Limit will be his son and Full his attendant.

source: གཏི་མུག་རྣམ་པར་སེལ་བ་མཁས་པ་སྟེ། །
en: “Dispeller of Dullness will be the scholar

source: ཉོན་མོངས་སྤོང་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Relinquisher of Defilements the one of miracles.

source: ཤེས་ལྡན་སྲིད་ལས་རྒལ་བ་དགྲ་བཅོམ་པ། །འདུས་པ་དང་པོར་བྱེ་བ་དྲུག་ཅུ་ཡོད། །གཉིས་པར་བདུན་ཅུ་གསུམ་པར་བརྒྱད་ཅུ་ཡོད། །
en: In the first congregation there will be six hundred million Worthy ones who have transcended existence. “In the second will be seven hundred million, and in the third there will be eight hundred million.

source: མཚུངས་པ་མེད་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་གསུམ་དུ་གནས། །
en: And after this incomparable being has attained nirvāṇa The sacred Dharma will remain for thirty million years.

source: དེ་ཡི་མཆོད་རྟེན་དག་ཀྱང་གཅིག་འབྱུང་ལ། །དཔག་ཚད་ཕྱེད་དང་གསུམ་ཁྱོན་རིན་ཆེན་ཁེབས། །
en: “There will be a single stūpa of his, Measuring three and a half leagues and studded with jewels.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཏོག་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་ཞེས་ཀྱང་བྱ། །
en: The thus-gone Ratnaketu will be born At a place called Joy.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གཉིས་ཡོད་ཡབ་ནི་རྣམ་པར་གནོན། །ཐམས་ཅད་དགའ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be kṣatriya, And his light will extend twenty-two leagues. Subjugator will be his father and Universal Joy his mother.

source: སྲས་པོ་བཟང་གྲགས་དྲི་མེད་རིམ་གྲོ་པ། །
en: Excellent Fame will be his son and Stainless his attendant.

source: ནམ་མཁའི་བློ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Sky Mind will be the scholar

source: རི་བོའི་འོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Mountain Light the one of miracles.

source: དགྲ་བཅོམ་འདུས་པ་བྱེ་བ་དགུ་བཅུ་བཞི། །འདུས་པ་གཉིས་པར་བྱེ་བ་དགུ་བཅུ་གསུམ། །འདུས་པ་གསུམ་པར་བྱེ་བ་དགུ་བཅུ་གཉིས། །
en: Nine hundred forty million worthy ones will gather. In the second congregation will be nine hundred thirty million, “And in the third there will be nine hundred twenty million.

source: དེ་ཡི་སྐུ་ཚེ་ལོ་གྲངས་དགུ་ཁྲི་ཡིན། །
en: His lifespan will be ninety thousand years,

source: སྲིད་གསུམ་མཆོད་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་པའི་ཆོས་ནི་ལོ་གྲངས་བྱེ་བར་གནས། །
en: And after this recipient of the worship of the three worlds has attained nirvāṇa The sacred Dharma will remain for ten million years.

source: སྐུ་གདུང་དག་ཀྱང་ལེགས་པར་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་དགུ་བཅུ་རྩ་གཉིས་འབྱུང་། །
en: “There will be abundant relics And nine hundred twenty million stūpas.

source: མགོན་པོ་ཐེ་ཚོམ་རྣམ་པར་སྤངས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བཀྲ་ཤིས་ཅན་ཞེས་བྱ། །
en: The protector Vigatakāṅkṣa will be born In a place called Auspicious.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་མྱ་ངན་མེད། །བློ་གྲོས་བཟང་མོ་ཞེས་བྱ་ཡུམ་ཡིན་ནོ། །
en: “His family will be brahmin, And his light will extend nine leagues. Free from Suffering will be his father and Excellent Intelligence his mother.

source: སྲས་པོ་རྙོག་མེད་ཤེས་ཅན་རིམ་གྲོ་པ། །
en: Unsullied will be his son and Knowledgeable his attendant.

source: དེས་པའི་ཤུགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Force of Certainty will be the scholar

source: རྫུ་འཕྲུལ་དགའ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Joyous Miracles the one of miracles.

source: འདུས་པ་དང་པོར་བྱེ་བ་ཕྲག་དགུ་ཡོད། །གཉིས་པར་བྱེ་བརྒྱད་གསུམ་པར་བྱེ་བ་བདུན། །
en: In the first congregation there will be ninety million, In the second there will be eighty million, and in the third there will be seventy million.

source: དེ་ཡི་ཚེ་ན་རྒྱལ་བའི་སྐུ་ཚེའི་ཚད། །ལོ་གྲངས་སུམ་བརྒྱ་དག་ཏུ་འགྱུར་བ་ཡིན། །
en: “At that time the lifespan of this victor Will be three hundred years,

source: རྒྱལ་བ་འགོག་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་ཉིས་སྟོང་བར་དུ་གནས་པར་འགྱུར། །
en: And after the victorious one has gone to cessation The sacred Dharma will remain for two thousand years.

source: དེ་ཡི་མཆོད་རྟེན་གཅིག་སྟེ་རིན་པོ་ཆེ། །བདུན་ལས་གྲུབ་པ་འཕང་དུ་དཔག་ཚད་གཅིག །
en: “There will be single stūpa, Made of the seven precious substances and one league tall.

source: བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་འདས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རྟག་ཏུ་དགའ་ཞེས་བྱ། །
en: The well-gone one Lokottīrṇa will be born In a place called Constant Joy.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་དཔག་ཚད། །དྲུག་ཡོད་ཡབ་ནི་སྲིད་པའི་ཟླ་བ་ཡིན། །ཚངས་འོད་ཅེས་བྱ་ཡུམ་ཡིན་སྲས་པོ་ནི། །ཚངས་བཟངས་གཙུག་ཕུད་འཕྱང་བ་རིམ་གྲོ་པ། །
en: “His family will be brahmin, And his light will extend six leagues. Moon of Existence will be his father and Brahmā Light his mother. Brahmā Excellence will be his son and Braided his attendant.

source: ཉི་མའི་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Sunlight will be the scholar

source: ཕྲད་མེད་ཅེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And No Contact the one of miracles.

source: དགྲ་བཅོམ་བྱེ་བ་ཕྲག་ནི་བཅུ་བཞི་སྟེ། །འདུས་པ་གཉིས་པར་བློ་ལྡན་སུམ་ཅུ་ཡོད། །དེ་ཚེ་གསུམ་པར་བྱེ་བ་ཉི་ཤུ་ཡོད། །
en: One hundred forty million worthy ones will gather. In the second congregation will be three hundred million endowed with wisdom, “And in the third congregation will be two hundred million.

source: འཇིག་རྟེན་འོད་མཛད་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་གསུམ་དུ་གནས། །
en: And after this illuminator of the world has attained nirvāṇa The sacred Dharma will remain for thirty million years.

source: མྱ་ངན་འདས་པའི་མཆོད་རྟེན་རིན་ཆེན་སྤྲས། །གྲངས་ནི་བྱེ་བ་བརྒྱད་ཅུ་ཚང་བར་འགྱུར། །
en: “The jewel-studded stūpas dedicated to nirvāṇa Will number eight hundred million.

source: སངས་རྒྱས་དོན་ཡོད་རྣམ་པར་གནོན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སྤྲིན་དང་ལྡན་ཞེས་བྱ། །
en: The buddha Amoghavikramin will be born In a place called Endowed with Clouds.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་དཔག་ཚད། །བདུན་ཡོད་ཡབ་ནི་དྲང་སྲོང་དབང་པོ་ཡིན། །ཚངས་པའི་དབྱངས་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be brahmin, And his light will extend seven leagues. Master of Sages will be his father and Brahmā Melody his mother.

source: སྲས་པོ་བདེ་འོད་བརྟན་པ་རིམ་གྲོ་པ། །
en: Light of Bliss will be his son and Steadfast his attendant.

source: ཡུལ་འཁོར་ཡེ་ཤེས་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Land of Wisdom will be the scholar

source: ཡིད་དུ་འོང་བའི་ང་རོ་རྫུ་འཕྲུལ་ཅན། །
en: And Delightful Roar the one of miracles.

source: དགྲ་བཅོམ་ང་མེད་བྱེ་བ་དགུ་བཅུ་དགུ། །གཉིས་པ་དག་ཏུ་དགུ་བཅུ་རྩ་བརྒྱད་ཡོད། །གསུམ་པ་དག་ཏུ་དགུ་བཅུ་རྩ་དྲུག་ཡོད། །
en: Nine hundred ninety million worthy ones without ‘I’ will gather. In the second gathering will be nine hundred eighty million, “And in the third there will be nine hundred sixty million.

source: དེའི་ཚེ་ལོ་ནི་དགུ་ཁྲི་ལྔ་སྟོང་ཡིན། །
en: At that time the lifespan will be ninety-five thousand years,

source: བདེ་བར་གཤེགས་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་པའི་ཆོས་ནི་ལོ་གྲངས་བྱེ་བར་གནས། །
en: And after this well-gone one has transcended suffering The sacred Dharma will remain for ten million years.

source: དེ་ཡི་སྐུ་གདུང་དག་ཀྱང་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་སུམ་ཅུ་གཉིས། །
en: “His relics will be abundant, And there will be thirty-two billion stūpas.

source: བདེ་བར་གཤེགས་པ་རྟོགས་པར་མཛད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བའི་སྤྲིན་ཞེས་བྱ། །
en: The well-gone Vibodhana will be born In a place called Clouds of Joy.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་སུམ་ཅུ་ཡབ་ནི་དབང་ཆེན་ཡིན། །རིན་ཆེན་དགའ་བ་ཡུམ་ཡིན་སྲས་པོ་ནི། །སྐྱེ་བོ་དགའ་བ་ཐུབ་པ་རིམ་གྲོ་པ། །
en: “The family of this victor will be kṣatriya, And his light will extend thirty leagues. Great Mastery will be his father and Precious Joy his mother. Delighting People will be his son and Capable his attendant.

source: ཆོས་ཀྱི་སྟོབས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Dharma Strength will be the scholar
